// email - ligin 로직 가져오기.
// 이메일 형식이 너무 짧은 경우, 입력하지 않은 경우, 유효하지 않은 경우 :  올바른 이메일 주소 형식을 입력해주세요. (예: example@example.com)
// 비밀번호 확인 유효성을 통과 못하였을 경우 : *비밀번호는 8자 이상, 20자 이하이며, 대문자, 소문자, 숫자, 특수문자를 각각 최소 1개 포함해야 합니다.
// 비밀번호 입력 안했을 시 : *비밀번호를 입력해주세요

// helper text (밀리지 않는다. 지정된 위치에서 보여짐) 이메일은 영문과 @, . 만 사용이 가능함
// 인풋값을 입력하다가 포커스아웃될 때
// 이메일 input
// 이메일이 비어 있는 경우 : 이메일을 입력해주세요.
// 이메일 형식이 너무 짧은 경우, 입력하지 않은 경우, 유효하지 않은 경우 :  *올바른 이메일 주소 형식을 입력해주세요. (예: example@example.com)
// 중복된 이메일인 경우 : *중복된 이메일 입니다.  




// 프로필 사진
// 프로필 사진 업로드 안했을 시 : *프로필 사진을 추가해주세요.


// 비밀번호, 비밀번호 확인 유효성 : *비밀번호는 8자 이상, 20자 이하이며, 대문자, 소문자, 숫자, 특수문자를 각각 최소 1개 포함해야 합니다.
// 비밀번호 input
// 비밀번호 입력 안했을 시 : *비밀번호를 입력해주세요
// 비밀번호가 확인과 다를시 : *비밀번호가 다릅니다. 
// 비밀번호 확인 input
// 비밀번호 확인 입력 안했을 시 : *비밀번호를 한번더 입력해주세요
// 비밀번호가 확인과 다를시 : *비밀번호가 다릅니다.

// 닉네임
// 닉네임 유효성 : 띄어쓰기불가, 10글자 이내
// 닉네임 입력하지 않을 시 : *닉네임을 입력해주세요.
// 닉네임에 띄어쓰기 있을 시 : *띄어쓰기를 없애주세요
// 닉네임 중복 시 : *중복된 닉네임 입니다.
// 닉네임 11자 이상 작성시 : *닉네임은 최대 10자 까지 작성 가능합니다. 
// 회원가입 버튼 
// 1번에 입력한 내용이 모두 작성되고 유효성 검사를 통과한 경우, 버튼이 활성화 된다. (  ACA0EB  > 7F6AEE  )
// 회원가입 버튼 클릭시
// 회원 정보는 저장되고 로그인 페이지로 이동한다.

// 인풋값에 입력한 내용이 부족할 시 버튼이 비활성화된다.